В папке Pages находится код работы со страницей:
1. Page_Objects - основные функции работы со страницей
2. PageLocators - локаторы расположения на странице элементов для заполнения
3. form_page - нахождение элементов для заполнение, отправка значений и получение результата 
В папке flow файл с генирацией данных для отправки и сверки полученных результатов после заполнения формы
В папке Test находится тест запускающий проверку: открытие страницы, заполнение формы, отправка, получение значений после отправки, сверка результатов. 
